[
  {
    "title": "Edutopia - What Works in Education",
    "content": "Play & RecessCommunicating With Parents About the Value of Play in PreschoolPractical tips for helping families understand what their kids are learning amid the seeming chaos of a preschool classroom.Sarah FritzYour content has been saved!Go to My Saved Content.Literacy6 Books to Inspire Student Writers in Elementary SchoolMentor texts can inspire students to more thoughtfully craft their language, and they make writing feel more fun.Donna PaulYour content has been saved!Go to My Saved Content.Critical ThinkingIntegrating Metacognitive Routines in Middle School ELAScaffolding reflective activities throughout the year provides students with a way to set goals and evaluate their own learning. Brady SmithYour content has been saved!Go to My Saved Content.STEMConnecting Science to Problem-Solving in the Real WorldTackling authentic problems in science class helps students see the link between the lab and the challenges facing our world—and builds multiple skills along the way.2Your content has been saved!Go to My Saved Content.Mental HealthHow to Cope With the Tragic Loss of a StudentTwo school counselors share advice for educators on how to support students when a peer passes away.Crystal FrommertYour content has been saved!Go to My Saved Content.Administration & LeadershipThe Case for Face-to-Face Debriefs After ObservationsAlthough quick, written feedback may seem efficient, talking with a teacher after an observation is much more effective.Kim MarshallYour content has been sa...",
    "url": "https://www.edutopia.org",
    "source": "edutopia_main",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:45:54.205397"
  },
  {
    "title": "EdSurge | Education Journalism and Research",
    "content": "Journalism that ignites your curiosity about education.",
    "url": "https://www.edsurge.com",
    "source": "edsurge_main",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:45:57.535368"
  },
  {
    "title": "Education Week - K-12 education news and information",
    "content": "Leadership \n        \n\n\nPolicy & Politics\n        \n\n\nTeaching & Learning \n        \n\n\nTechnology\n        \n\n\nOpinion\n        \n\n\nJobs \n        \n\n\nMarket Brief\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStates\n\nSome State Leaders Cheer as Trump's Ed. Dept. Investigates Their Schools\nThe use of the office for civil rights for political purposes has escalated in Trump's second term.\n\nBrooke Schultz\n•\n\n6 min read\n\n\n\nRemove\n\nSave to favorites\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen image caption\n\n\n\n\nClose image caption\n\n\n\n                A newly-constructed gender-neutral bathroom is seen at Shawnee Mission East High School, Friday, June 16, 2023, in Prairie Village, Kan. The Shawnee Mission school district is one of four in Kansas that the Trump administration has started investigating at the urging of the state's Republican attorney general, Kris Kobach.\n            \n\n                Charlie Riedel/AP\n            \n\n\n\n\n\n\n\n\n\n\n\nProfessional Development\nQ&A\n\nWhy Principals Are Essential in Connecting Classrooms to Careers\nA new course helps principals integrate skills and career exposure into their existing curriculum.\n\nLauraine Langreo\n•\n\n4 min read\n\n\n\nRemove\n\nSave to favorites\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen image caption\n\n\n\n\nClose image caption\n\n\n\n                Students from Food and Finance High School serve foods during a summer block party outside the Barclays Center, July 11, 2024, in New York. Career-connected learning not only prepares students for future job prospects but also makes their K-12 experience relevant.\n          ...",
    "url": "https://www.edweek.org",
    "source": "edweek_main",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:00.967365"
  },
  {
    "title": "Education",
    "content": "Topics\n\n                    Education\n                \nOur experts conduct extensive research on education, addressing various topics like school accountability, instructional technology, teacher evaluation, the impact of curriculum, student loans, preschool education, and public pensions. We strive to provide actionable strategies to shape effective policies and practices and ensure equal opportunities for all learners in a rapidly changing world.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Topics\n  \n\n\nEarly Childhood Education\n\n\nEducation\n\n\nEducation Access & Equity\n\n\nEducation Policy\n\n\nEducation Technology\n\n\nGlobal Education\n\n\nHigher Education\n\n\nK-12 Education\n\n\n\nSee More\n\n\n\n\n\n\n\n\n\n\nSchools’ vulnerability to climate hazards according to FEMA’s Risk Index\n\n\n\n\n\n\n\nEducation\n\n\n        Schools’ vulnerability to climate hazards according to FEMA’s Risk Index\n\t\t      \n\n\n\t\t  \t\t\t\t\t\t\t\t\t\t\t\tNicolas Zerbino\t\t\t\t\t\t\t\t\t            \n\n            August 26, 2025\n          \n\n\n\n\n\n\n\n\n\n\nClimate change is an urgent but often overlooked education policy issue\n\n\n\n\n\n\n\nClimate Change\n\n\n        Climate change is an urgent but often overlooked education policy issue\n\t\t      \n\n\n\t\t  \t\t\t\t\t\t\t\t\t\t\t\tMatthew A. Kraft, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSohil Malik, \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGrace T. Falken\t\t\t\t\t\t\t\t\t            \n\n            August 26, 2025\n          \n\n\n\n\n\n\n\n\nWhat harsh immigration policies mean for students, families, and schools\n\n\n\n\n\n\n\nImmigrants & Immigration\n\n\n        What harsh immigration policies mean for students, families, and schools\n\t\t...",
    "url": "https://www.brookings.edu/topic/education/",
    "source": "brookings_education",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:04.526950"
  },
  {
    "title": "Education",
    "content": "The World Bank Group is the largest financier of education in the developing world, working in 85 countries and committed to helping them reach SDG4: access to inclusive and equitable quality education and lifelong learning opportunities for all by 2030. Aisha Nuur Hassan, a teenaged Somali girl, is one of 2,278 Somali girls empowered by the Rajo Kaaba Program to pursue higher education. Learn how AI is transforming higher education at an unprecedented pace.",
    "url": "https://www.worldbank.org/en/topic/education",
    "source": "world_bank_education",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:12.312897"
  },
  {
    "title": "Benefits of education",
    "content": "Education is one of the most important investments a country can make in its future. GPE supports lower-income countries to ensure that every child receives a quality education, gaining the skills they need to thrive in the 21st century. Education is a powerful agent of change, and improves health and livelihoods, contributes to social stability and drives long-term economic growth. Education is essential to the success of every one of the 17 sustainable development goals. GPE helps partner countries transform their education systems to ensure that every girl and boy can get the quality education they need to unlock their full potential and contribute to building a better world.",
    "url": "https://www.globalpartnership.org/education",
    "source": "global_partnership_education",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:19.046233"
  },
  {
    "title": "Code.org's Approach to Diversity and Equity in CS",
    "content": "The fields of software, computing, and computer science are plagued by stark underrepresentation by gender, race, ethnicity, geography, and family income. While nearly 58% of U.S. high schools offer foundational computer science, disparities in access persist. Rural schools, urban schools, and schools with high percentages of economically disadvantaged students are less likely to offer computer science; and Black/African American students, Hispanic/Latino/Latina/Latinx students, and Native American/Alaskan students are less likely to attend a school that offers it. More important than the tech workforce pipeline, computer science is now a foundational subject for all 21st-century careers, making access in K-12 to this knowledge an equity issue that must be addressed. Our goal at Code.org is for every student in every school to have the opportunity to learn computer science, and to reach balanced representation in grades K-12. Working towards that goal, we use a holistic approach that spans marketing, curriculum, professional learning, and government policy to close gaps in participation and improve equity across gender, race, income, and geography. We measure our success not only by the total number of students learning computer science, but also by the participation of students from underrepresented groups.",
    "url": "https://code.org/diversity",
    "source": "code_org_equity",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:22.417853"
  },
  {
    "title": "Khan Academy",
    "content": "",
    "url": "https://www.khanacademy.org/about",
    "source": "khan_academy_mission",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:25.951395"
  },
  {
    "title": "Imagine what we can become.",
    "content": "MIT MAD has established new professorships and appointed three MIT faculty to advance design education across disciplines. She is recognized for her distinguished contributions in the field of artificial intelligence education. This award honors an individual or group in recognition of a significant contribution to computer science education.",
    "url": "https://www.media.mit.edu",
    "source": "mit_media_lab",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:29.300051"
  },
  {
    "title": "Home",
    "content": "Stanford Graduate School of Education is dedicated to solving education's greatest challenges. Through rigorous research, model training programs and partnerships with educators worldwide, we're pursuing equitable, accessible and effective learning for all. Curriculum and Instruction\n     | \n      Research and Practice\n     | \n      Science and Math Education Data Science\n     | \n      Education Policy\n     | \n      International Education",
    "url": "https://ed.stanford.edu",
    "source": "stanford_education",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:32.995113"
  },
  {
    "title": "Home",
    "content": "Find everything you need to apply for and finance your graduate education. Access the premiere education subject library for Harvard University. Find everything you need to apply for and finance your graduate education.",
    "url": "https://www.gse.harvard.edu",
    "source": "harvard_education",
    "type": "educational_organization",
    "category": "education_technology",
    "focus": "underserved_communities_education",
    "scraped_at": "2025-08-26T22:46:36.432254"
  },
  {
    "title": "mEducation Alliance: Bridging the Digital Divide",
    "content": "The mEducation Alliance is the world's largest convening platform for the global EdTech community, with a specific focus on advancing education technology in lower-resource countries and underserved communities. Established by USAID in 2010, the Alliance brings together over 60 organizational members to coordinate international efforts in utilizing technology to support education where it's needed most.",
    "source": "meducation_alliance",
    "type": "organization",
    "category": "alliance_overview",
    "focus": "digital_divide_education",
    "scraped_at": "2025-08-26T22:46:39.433983"
  },
  {
    "title": "Math Power! Initiative: Technology for Underserved Students",
    "content": "Math Power! is a signature mEducation Alliance initiative that addresses the technology gap in mathematics education. The program provides digital tools, resources, and training specifically designed for underserved communities where access to quality math education is limited. It targets rural schools, low-income districts, and developing country contexts to make math learning engaging and accessible through innovative EdTech solutions.",
    "source": "meducation_alliance",
    "type": "initiative",
    "category": "mathematics_education",
    "focus": "underserved_students_math",
    "scraped_at": "2025-08-26T22:46:39.434002"
  },
  {
    "title": "Literacy League: Digital Reading for All Communities",
    "content": "The Literacy League initiative focuses on improving literacy skills through technology-enhanced learning, with particular emphasis on communities with limited access to traditional educational resources. The program provides digital reading tools, interactive content, and assessment resources designed for diverse learning environments, from rural schools to urban underserved areas.",
    "source": "meducation_alliance",
    "type": "initiative",
    "category": "literacy_development",
    "focus": "digital_literacy_access",
    "scraped_at": "2025-08-26T22:46:39.434006"
  },
  {
    "title": "#InspirationSTEM-Girls: Empowering Underserved Communities",
    "content": "#InspirationSTEM-Girls is designed to inspire and empower girls in STEM fields, with special focus on underserved communities where gender gaps in technology education are most pronounced. The initiative provides role models, hands-on learning experiences, and digital resources to encourage girls from all backgrounds to pursue careers in science, technology, engineering, and mathematics.",
    "source": "meducation_alliance",
    "type": "initiative",
    "category": "stem_education",
    "focus": "girls_stem_underserved",
    "scraped_at": "2025-08-26T22:46:39.434008"
  },
  {
    "title": "Youth Digital Champions: Technology Leadership in Communities",
    "content": "Youth Digital Champions focuses on developing digital literacy and leadership skills among young people in underserved communities. The initiative provides training in digital tools, coding, and technology leadership, empowering youth to become digital advocates in their communities and preparing them for the digital economy regardless of their geographic or socioeconomic background.",
    "source": "meducation_alliance",
    "type": "initiative",
    "category": "digital_literacy",
    "focus": "youth_technology_leadership",
    "scraped_at": "2025-08-26T22:46:39.434011"
  },
  {
    "title": "Educational Gaming: Engaging Underserved Students",
    "content": "The Educational Escape/Storytelling Games initiative uses educational gaming and storytelling to enhance learning experiences in communities where traditional educational resources may be limited. It develops interactive games and digital storytelling tools that make learning engaging and memorable, particularly effective for students in underserved areas who may have limited access to other educational technologies.",
    "source": "meducation_alliance",
    "type": "initiative",
    "category": "educational_gaming",
    "focus": "gaming_underserved_education",
    "scraped_at": "2025-08-26T22:46:39.434014"
  },
  {
    "title": "mEducation Alliance Events: Global Collaboration for Equity",
    "content": "The mEducation Alliance hosts three major symposia annually that bring together educators, technologists, and policymakers to address educational technology challenges in underserved communities. These events focus on sharing best practices and innovations in EdTech that can bridge the digital divide and improve educational outcomes in lower-resource settings worldwide.",
    "source": "meducation_alliance",
    "type": "events",
    "category": "conferences_symposia",
    "focus": "global_education_equity",
    "scraped_at": "2025-08-26T22:46:39.434017"
  }
]